package mod2;
/*
Реализуйте метод, проверяющий, является ли заданная строка палиндромом. Палиндромом называется строка, которая читается
 одинаково слева направо и справа налево (в том числе пустая). При определении "палиндромности" строки должны
  учитываться только буквы и цифры. А пробелы, знаки препинания, а также регистр символов должны игнорироваться.
  Гарантируется, что в метод попадают только строки, состоящие из символов ASCII (цифры, латинские буквы,
   знаки препинания). Т.е. русских, китайских и прочих экзотических символов в строке не будет.

Воспользуйтесь предоставленным шаблоном. Декларацию класса, метод main и обработку ввода-вывода добавит проверяющая система.

Подсказки (не читайте, если хотите решить сами):

для удаления из строки всех символов, не являющихся буквами и цифрами, можно воспользоваться регулярным выражением "[^a-zA-Z0-9]"; найдите в классе String метод, выполняющий замену по регулярному выражению;
для перестановки символов строки в обратном порядке можно воспользоваться методом reverse(), который находится в классе StringBuilder;
в классе String есть методы для преобразования всей строки в верхний и нижний регистр.
Sample Input:

Madam, I'm Adam!
Sample Output:

true
 */

public class StringPalindrom {

    public boolean isPalindrome(String text) {
        if(text.length() == 0 || text.length() == 1) {
            return true;
        } else {
            StringBuilder stringBuilder = new StringBuilder(text.replaceAll("[^A-Za-z1-9]+", "").toLowerCase());
            stringBuilder.reverse();
            return stringBuilder.toString().equals(stringBuilder.reverse().toString());
        }
    }
}
